In [1]:
import pandas as pd

In [2]:
!ls ../../datasets

titanic.csv     titanic.csv.zip

In [3]:
local_source = '../../datasets/titanic.csv'
df = pd.read_csv(local_source)

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 6.1 Spliting data into other data frames based on column values (Keeping the same headers) - Horizontal Split

In [5]:
df_male = df[df['Sex'] == 'male']

In [6]:
df_male

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df_female = df[df['Sex'] == 'female']

In [8]:
df_female

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

# 6.2 Spliting data into other data frames based on column values and selecting few columns - Vertical Split

In [9]:
df_split_4_columns = df[['Name', 'Sex','Age', 'Ticket']]

In [10]:
df_split_4_columns

,Name,Sex,Age,Ticket
0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
2,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
4,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,211536
887,"Graham, Miss. Margaret Edith",female,19.0,112053
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
889,"Behr, Mr. Karl Howell",male,26.0,111369
890,"Dooley, Mr. Patrick",male,32.0,370376

In [13]:
df_split_8_columns = df[['Name', 'Survived', 'Pclass','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]

In [14]:
df_split_8_columns

,Name,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",0,3,1,0,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1,1,0,71.2833,C85,C
2,"Heikkinen, Miss. Laina",1,3,0,0,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1,1,0,53.1000,C123,S
4,"Allen, Mr. William Henry",0,3,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",0,2,0,0,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",1,1,0,0,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,1,2,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",1,1,0,0,30.0000,C148,C
890,"Dooley, Mr. Patrick",0,3,0,0,7.7500,NaN,Q

# 6.3 Pandas Concat - Combine Rows with the same header

pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None,
              levels=None, names=None, verify_integrity=False, sort=False, copy=True)

- objs is the list of DataFrame objects ([df1, df2, ...]) to be concatenated
- axis defines the direction of the concatenation, 0 for row-wise and 1 for column-wise
- join can either be inner (intersection) or outer (union)

### we already have df_male and df_female data frames with the exact same header

In [15]:
df_mix_sex = pd.concat([df_female, df_male])

In [16]:
df_mix_sex

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
df_mix_sex = pd.concat([df_female, df_male]).reset_index(drop = True)

In [18]:
df_mix_sex

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
3,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
4,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
886,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
887,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
888,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
df_male.shape

(577, 12)

In [20]:
df_female.shape

(314, 12)

In [21]:
pd.concat([df_male, df_female],ignore_index=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
2,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
3,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
4,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
888,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
889,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [22]:
pd.concat([df_male, df_female])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [23]:
pd.concat([df_male, df_female], sort=['Ticket'])

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0,330877
6,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,7,1,male,0,0,17463
7,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,8,3,male,3,0,349909
...,...,...,...,...,...,...,...,...,...,...,...,...
880,25.0,NaN,S,26.0000,"Shelley, Mrs. William (Imanita Parrish Hall)",1,881,2,female,0,1,230433
882,22.0,NaN,S,10.5167,"Dahlberg, Miss. Gerda Ulrika",0,883,3,female,0,0,7552
885,39.0,NaN,Q,29.1250,"Rice, Mrs. William (Margaret Norton)",5,886,3,female,0,0,382652
887,19.0,B42,S,30.0000,"Graham, Miss. Margaret Edith",0,888,1,female,0,1,112053
888,NaN,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0,W./C. 6607

### Note: Pandas concat function work both horizontally and vertically. 
- To join two DataFrames together column-wise, you need to change the axis value from the default 0 to 1
- axis : 0 (Rowwise Concat)
- axis : 1 (Columnwide Concat)

# 6.4 Pandas Concat Option - Merge Columns

In [24]:
df_concat_left = df[['Name', 'Sex','Age', 'Ticket']]

In [25]:
df_concat_right = df[['Name', 'Survived', 'Pclass','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]

In [26]:
pd.concat([df_concat_left, df_concat_right], axis= 1 )

,Name,Sex,Age,Ticket,Name,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,"Braund, Mr. Owen Harris",0,3,1,0,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1,1,0,71.2833,C85,C
2,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,"Heikkinen, Miss. Laina",1,3,0,0,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1,1,0,53.1000,C123,S
4,"Allen, Mr. William Henry",male,35.0,373450,"Allen, Mr. William Henry",0,3,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,211536,"Montvila, Rev. Juozas",0,2,0,0,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",female,19.0,112053,"Graham, Miss. Margaret Edith",1,1,0,0,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,1,2,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",male,26.0,111369,"Behr, Mr. Karl Howell",1,1,0,0,30.0000,C148,C
890,"Dooley, Mr. Patrick",male,32.0,370376,"Dooley, Mr. Patrick",0,3,0,0,7.7500,NaN,Q

# 6.5 Pandas merge Option

pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)

## Merging with Non Indexed DataFrame

In [27]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
df_a = df[['Name', 'Sex','Age', 'Ticket']]

In [29]:
df_a

,Name,Sex,Age,Ticket
0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
2,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
4,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,211536
887,"Graham, Miss. Margaret Edith",female,19.0,112053
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
889,"Behr, Mr. Karl Howell",male,26.0,111369
890,"Dooley, Mr. Patrick",male,32.0,370376

In [30]:
df_b = df[['Name', 'Survived', 'Pclass','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]

In [31]:
df_b

,Name,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",0,3,1,0,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,1,1,0,71.2833,C85,C
2,"Heikkinen, Miss. Laina",1,3,0,0,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,1,1,0,53.1000,C123,S
4,"Allen, Mr. William Henry",0,3,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",0,2,0,0,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",1,1,0,0,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",0,3,1,2,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",1,1,0,0,30.0000,C148,C
890,"Dooley, Mr. Patrick",0,3,0,0,7.7500,NaN,Q

In [32]:
df_merged_non_index = pd.merge(df_a, df_b)

In [33]:
df_merged_non_index

,Name,Sex,Age,Ticket,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,0,3,1,0,7.2500,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,1,1,1,0,71.2833,C85,C
2,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,1,3,0,0,7.9250,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,1,1,1,0,53.1000,C123,S
4,"Allen, Mr. William Henry",male,35.0,373450,0,3,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,211536,0,2,0,0,13.0000,NaN,S
887,"Graham, Miss. Margaret Edith",female,19.0,112053,1,1,0,0,30.0000,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607,0,3,1,2,23.4500,NaN,S
889,"Behr, Mr. Karl Howell",male,26.0,111369,1,1,0,0,30.0000,C148,C
890,"Dooley, Mr. Patrick",male,32.0,370376,0,3,0,0,7.7500,NaN,Q

## Merging with Indexed DataFrame

In [35]:
df_indexed = pd.read_csv(local_source, index_col= 'PassengerId')

In [36]:
df_indexed

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [37]:
df_part_1 = df_indexed[['Survived', 'Pclass','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]

In [38]:
df_part_1

             Survived  Pclass  SibSp  Parch     Fare Cabin Embarked
PassengerId
1                   0       3      1      0   7.2500   NaN        S
2                   1       1      1      0  71.2833   C85        C
3                   1       3      0      0   7.9250   NaN        S
4                   1       1      1      0  53.1000  C123        S
5                   0       3      0      0   8.0500   NaN        S
...               ...     ...    ...    ...      ...   ...      ...
887                 0       2      0      0  13.0000   NaN        S
888                 1       1      0      0  30.0000   B42        S
889                 0       3      1      2  23.4500   NaN        S
890                 1       1      0      0  30.0000  C148        C
891                 0       3      0      0   7.7500   NaN        Q

[891 rows x 7 columns]

In [39]:
df_part_2 = df_indexed[['Name', 'Sex','Age', 'Ticket']]

In [40]:
df_part_2

,Name,Sex,Age,Ticket
PassengerId,,,,
1,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
5,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,211536
888,"Graham, Miss. Margaret Edith",female,19.0,112053
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
890,"Behr, Mr. Karl Howell",male,26.0,111369
891,"Dooley, Mr. Patrick",male,32.0,370376

In [41]:
df_merged = pd.merge(df_part_1, df_part_2, left_index=True, right_index=True)

In [42]:
df_merged

,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,Name,Sex,Age,Ticket
PassengerId,,,,,,,,,,,
1,0,3,1,0,7.2500,NaN,S,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
2,1,1,1,0,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
3,1,3,0,0,7.9250,NaN,S,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
4,1,1,1,0,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
5,0,3,0,0,8.0500,NaN,S,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,0,13.0000,NaN,S,"Montvila, Rev. Juozas",male,27.0,211536
888,1,1,0,0,30.0000,B42,S,"Graham, Miss. Margaret Edith",female,19.0,112053
889,0,3,1,2,23.4500,NaN,S,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
890,1,1,0,0,30.0000,C148,C,"Behr, Mr. Karl Howell",male,26.0,111369
891,0,3,0,0,7.7500,NaN,Q,"Dooley, Mr. Patrick",male,32.0,370376

In [43]:
df_merged = pd.merge(df_female, df_male)

In [44]:
df_merged

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

# 6.6 Pandas Join method to combine two DataFrames

DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False).

In [45]:
df_joined_left = df_part_1.join(df_part_2)

In [46]:
df_joined_left

,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,Name,Sex,Age,Ticket
PassengerId,,,,,,,,,,,
1,0,3,1,0,7.2500,NaN,S,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
2,1,1,1,0,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
3,1,3,0,0,7.9250,NaN,S,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
4,1,1,1,0,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
5,0,3,0,0,8.0500,NaN,S,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,0,13.0000,NaN,S,"Montvila, Rev. Juozas",male,27.0,211536
888,1,1,0,0,30.0000,B42,S,"Graham, Miss. Margaret Edith",female,19.0,112053
889,0,3,1,2,23.4500,NaN,S,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
890,1,1,0,0,30.0000,C148,C,"Behr, Mr. Karl Howell",male,26.0,111369
891,0,3,0,0,7.7500,NaN,Q,"Dooley, Mr. Patrick",male,32.0,370376

In [47]:
df_joined_right = df_part_1.join(df_part_2, how = "right")

In [48]:
df_joined_right

,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,Name,Sex,Age,Ticket
PassengerId,,,,,,,,,,,
1,0,3,1,0,7.2500,NaN,S,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
2,1,1,1,0,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
3,1,3,0,0,7.9250,NaN,S,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
4,1,1,1,0,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
5,0,3,0,0,8.0500,NaN,S,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,0,13.0000,NaN,S,"Montvila, Rev. Juozas",male,27.0,211536
888,1,1,0,0,30.0000,B42,S,"Graham, Miss. Margaret Edith",female,19.0,112053
889,0,3,1,2,23.4500,NaN,S,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
890,1,1,0,0,30.0000,C148,C,"Behr, Mr. Karl Howell",male,26.0,111369
891,0,3,0,0,7.7500,NaN,Q,"Dooley, Mr. Patrick",male,32.0,370376

In [49]:
df_joined_left = df_part_1.join(df_part_2, how = "left")

In [50]:
df_joined_left

,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,Name,Sex,Age,Ticket
PassengerId,,,,,,,,,,,
1,0,3,1,0,7.2500,NaN,S,"Braund, Mr. Owen Harris",male,22.0,A/5 21171
2,1,1,1,0,71.2833,C85,C,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599
3,1,3,0,0,7.9250,NaN,S,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282
4,1,1,1,0,53.1000,C123,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803
5,0,3,0,0,8.0500,NaN,S,"Allen, Mr. William Henry",male,35.0,373450
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,0,0,13.0000,NaN,S,"Montvila, Rev. Juozas",male,27.0,211536
888,1,1,0,0,30.0000,B42,S,"Graham, Miss. Margaret Edith",female,19.0,112053
889,0,3,1,2,23.4500,NaN,S,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,W./C. 6607
890,1,1,0,0,30.0000,C148,C,"Behr, Mr. Karl Howell",male,26.0,111369
891,0,3,0,0,7.7500,NaN,Q,"Dooley, Mr. Patrick",male,32.0,370376

# 6.7 Pandas Append method to combine two DataFrames

Append command is applicable to DataFrame and very useful to merge two DataFrames based on row axis where the headers are same between two dataframes

In [51]:
df_male

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [52]:
df_female

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [53]:
df_male_female_appended = df_male.append(df_female)

In [54]:
df_male_female_appended

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [ ]:
df_male

In [55]:
df_male_local = df_male

In [56]:
df_male_local.append(df_female)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [57]:
df_male_local

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Note:
- When append() is applied, it will not match DataFrames on any keys. 
- The result does not update the actuall DataFrame instead return a result in new data frame
- If DataFrames shape do not match, all unmatched cells will be replaced by NaN value

# 6.8 Pandas Update method to combine two DataFrames

### Note:
- Update function does the inplace data update in the dataframe where it is called
- It does not add a new rows, instead just update the data in the matched rows
- If there is no matching data in second dataframe, the first dataframe will not change

In [66]:
df_male

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [67]:
df_female

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [68]:
df_male_local = df_male

In [69]:
df_male_local.update(df_female)

In [70]:
df_male_local

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [71]:
df_male_local.iloc[101,0:]

PassengerId                    159
Survived                         0
Pclass                           3
Name           Smiljanic, Mr. Mile
Sex                           male
Age                            NaN
SibSp                            0
Parch                            0
Ticket                      315037
Fare                        8.6625
Cabin                          NaN
Embarked                         S
Name: 158, dtype: object

In [72]:
df_male_local.iloc[10]

PassengerId                       22
Survived                           1
Pclass                             2
Name           Beesley, Mr. Lawrence
Sex                             male
Age                               34
SibSp                              0
Parch                              0
Ticket                        248698
Fare                              13
Cabin                            D56
Embarked                           S
Name: 21, dtype: object

In [73]:
df_male_local.iloc[[10]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0,D56,S

In [74]:
df_row_selected = df_male_local.iloc[[10]]

In [75]:
df_row_selected

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0,D56,S

In [76]:
df_row_selected.loc[df_row_selected['PassengerId'] == 22,'Survived']

21    1
Name: Survived, dtype: int64

In [77]:
df_row_selected.loc[df_row_selected['PassengerId'] == 22,'Survived'] = 5

/Users/avkash/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [78]:
df_row_selected

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
21,22,5,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0,D56,S

In [79]:
df_male_local.update(df_row_selected)

/Users/avkash/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:5732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[col] = expressions.where(mask, this, that)

In [80]:
df_male_local.iloc[10]

PassengerId                       22
Survived                           5
Pclass                             2
Name           Beesley, Mr. Lawrence
Sex                             male
Age                               34
SibSp                              0
Parch                              0
Ticket                        248698
Fare                              13
Cabin                            D56
Embarked                           S
Name: 21, dtype: object

# Bonus Tip: Reading Clipboard

In [92]:
dfc = pd.read_clipboard()

In [93]:
dfc

,,,,,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund,",Mr.,Owen,Harris,male,22.0,1,0,A/5,21171.0000,7.2500,NaN,S
4,5,0,3,"Allen,",Mr.,William,Henry,male,35.0,0,0,373450,8.0500,NaN,S,None
5,6,0,3,"Moran,",Mr.,James,male,NaN,0,0,330877,8.4583,NaN,Q,None,None
6,7,0,1,"McCarthy,",Mr.,Timothy,J,male,54.0,0,0,17463,51.8625,E46,S,None
7,8,0,3,"Palsson,",Master.,Gosta,Leonard,male,2.0,3,1,349909,21.0750,NaN,S,None
...,...,...,...,...,...,...,...,...,...,...,...,...,NaN,None,None,None
883,884,0,2,"Banfield,",Mr.,Frederick,James,male,28.0,0,0,C.A./SOTON,34068.0000,10.5000,NaN,S
884,885,0,3,"Sutehall,",Mr.,Henry,Jr,male,25.0,0,0,SOTON/OQ,392076.0000,7.0500,NaN,S
886,887,0,2,"Montvila,",Rev.,Juozas,male,27.0,0,0,211536,13.0000,NaN,S,None,None
889,890,1,1,"Behr,",Mr.,Karl,Howell,male,26.0,0,0,111369,30.0000,C148,C,None
890,891,0,3,"Dooley,",Mr.,Patrick,male,32.0,0,0,370376,7.7500,NaN,Q,None,None